In [1]:
import pandas as pd
import numpy as np
from sklearn import tree
from sklearn import preprocessing #used to convert text to numerical or missing value

In [2]:
titanic_train =pd.read_csv("train.csv")

In [3]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_train.shape

(889, 12)

In [5]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000
mean,446.000000,0.382452,2.311586,32.699854,0.524184,0.382452,32.096681
std,256.998173,0.486260,0.834700,14.346821,1.103705,0.806761,49.697504
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,224.000000,0.000000,2.000000,22.000000,0.000000,0.000000,7.895800
50%,446.000000,0.000000,3.000000,32.000000,0.000000,0.000000,14.454200
75%,668.000000,1.000000,3.000000,45.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
titanic_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [7]:
titanic_train["Age"].mean()

32.69985376827896

In [8]:
#Replacing missing value
new_age_var = np.where(titanic_train["Age"].isnull(),32,titanic_train["Age"])

In [9]:
titanic_train["Age"] = new_age_var

In [10]:
titanic_train.Age.isnull().sum()

0

In [11]:
#converting male and female into numerbical value
#Label encoder is used to convert more then 2 categories of text to numberical
label_encoder = preprocessing.LabelEncoder()
encoded_sex = label_encoder.fit_transform(titanic_train["Sex"]) #fit_transform function is used to transform the code

In [12]:
tree_model = tree.DecisionTreeClassifier()
tree_model.fit(X= pd.DataFrame(encoded_sex), y = titanic_train["Survived"])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [13]:
#visualization
with open("Dtree1.dot", 'w') as f:
    f= tree.export_graphviz(tree_model, feature_names=["Sex"], out_file =f);

In [14]:
#Adding another Independent variable
predictors = pd.DataFrame([encoded_sex, titanic_train["Pclass"]]).T
tree_model.fit(X=predictors, y=titanic_train["Survived"])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [15]:
#visualization
with open("Dtree2.dot", 'w') as f:
    f= tree.export_graphviz(tree_model, feature_names=["Sex","Pclass"],out_file =f);

In [16]:
predictors = pd.DataFrame([encoded_sex, titanic_train["Pclass"],titanic_train["Age"],titanic_train["Fare"]]).T
tree_model = tree.DecisionTreeClassifier(max_depth =8)
tree_model.fit(X=predictors, y=titanic_train["Survived"])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=8, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [17]:
with open("Dtree3.dot", 'w') as f:
    f= tree.export_graphviz(tree_model, feature_names=["Sex","Pclass","Age","Fare"],out_file =f);

In [18]:
tree_model.score(X=predictors, y=titanic_train["Survived"])

0.8965129358830146

In [19]:
#Decision tree for prediction
titanic_test= pd.read_csv("test.csv")

In [20]:
titanic_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...
412,1305,3,"Spector, Mr. Woolf",male,45.0,0,0,A.5. 3236,8.0500,S
413,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C
414,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S
415,1308,3,"Ware, Mr. Frederick",male,45.0,0,0,359309,8.0500,S
416,1309,3,"Peter, Master. Michael J",male,45.0,1,1,2668,22.3583,C

In [21]:
titanic_test.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [22]:
titanic_test.mean()

PassengerId    1100.635492
Pclass            2.263789
Age              33.237410
SibSp             0.448441
Parch             0.393285
Fare             35.627188
dtype: float64

In [23]:
#converting gender into numerical form
num_test_sex = label_encoder.fit_transform(titanic_test['Sex'])

In [24]:
num_test_sex

array([1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1,
       0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0,
       0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0,
       0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0,
       0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1,
       0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1,
       1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1,
       0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0,
       0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1,
       0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1])

In [25]:
test_features = pd.DataFrame([num_test_sex, titanic_test["Pclass"],titanic_test["Age"], titanic_test["Fare"]]).T

In [26]:
test_pred = tree_model.predict(X=test_features)

In [27]:
predicted_output = pd.DataFrame({"PassengerId":titanic_test["PassengerId"], "Survived":test_pred})

In [28]:
predicted_output.to_csv("Output.csv",index=False);

In [29]:
Output_titainic_test = pd.read_csv("Output_titanic_test.csv")

In [30]:
Output_titainic_test.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         0

In [31]:
Output_titainic_test.mean()

PassengerId    1100.635492
Survived          0.347722
dtype: float64

In [32]:
#Random Forest
#finding important Variable
from sklearn.ensemble import RandomForestClassifier
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [33]:
lable_encoder = preprocessing.LabelEncoder()

In [34]:
titanic_train["Sex"]=label_encoder.fit_transform(titanic_train["Sex"])
titanic_train["Embarked"]=label_encoder.fit_transform(titanic_train["Embarked"])

In [35]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

In [36]:
random_forest = RandomForestClassifier(n_estimators=1000, max_features=2, oob_score=True)

In [37]:
features= ["Sex","Pclass", "SibSp", "Embarked", "Age", "Fare"]

In [38]:
random_forest.fit(X=titanic_train[features], y=titanic_train["Survived"])

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features=2,
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [39]:
print(" OOB Score:", random_forest.oob_score_)

 OOB Score: 0.8098987626546682

In [40]:
#finding important features
for features, imp in zip(features, random_forest.feature_importances_):
    print(features,imp);

Sex 0.2703754498303653
Pclass 0.08930659444765668
SibSp 0.052573618792077614
Embarked 0.03401227052732452
Age 0.2697930689197909
Fare 0.283938997482785